app/Controllers/Admin.php

    public function dashboard()
    {
        // **FIX: Load data untuk dashboard**
        $data = [
            'title' => 'Dashboard Admin',
            'bookings' => $this->bookingModel->findAll(),
            'rooms' => $this->roomModel->findAll(),
            'users' => $this->userModel->findAll()
        ];
---
SELECT *
FROM `bookings`
SELECT *
FROM `rooms`
SELECT *
FROM `users`

    public function updateBookingStatus($bookingId = null)
    {
        // Get booking ID from URL parameter or POST data
        if (!$bookingId) {
            $bookingId = $this->request->getPost('booking_id');
        }

        if (!$bookingId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Booking ID tidak ditemukan'
            ]);
        }

        $json = $this->request->getJSON();
        $status = $json->booking_status ?? null;

        if (!$status) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Status tidak ditemukan'
            ]);
        }

        try {
            $updateData = ['booking_status' => $status];
            $updated = $this->bookingModel->update($bookingId, $updateData);
---
UPDATE `bookings` SET `booking_status` = 'cancelled', `updated_at` = '2025-06-18 05:25:29'
WHERE `bookings`.`id` IN ('26')

    public function updatePaymentStatus($bookingId = null)
    {
        // Get booking ID from URL parameter
        if (!$bookingId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Booking ID tidak ditemukan'
            ]);
        }

        $json = $this->request->getJSON();
        $status = $json->payment_status ?? null;

        if (!$status) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Status tidak ditemukan'
            ]);
        }

        try {
            $updateData = ['payment_status' => $status];
            $updated = $this->bookingModel->update($bookingId, $updateData);
---
UPDATE `bookings` SET `payment_status` = 'refunded', `updated_at` = '2025-06-18 05:26:00'
WHERE `bookings`.`id` IN ('26')