app/Controllers/Auth.php

            return redirect()->to('/login')->with('error', 'Username atau password salah!');
        }

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'postingpow'
 LIMIT 1