app/Controllers/Auth.php

    public function register()
    {
        $userModel = new UserModel();

        // Cek username/email sudah ada
        $username = $this->request->getPost('username');
        $email    = $this->request->getPost('email');

        if ($userModel->where('username', $username)->first()) {
            return redirect()->to('/login')->with('error', 'Username sudah terdaftar!');
        }
        if ($userModel->where('email', $email)->first()) {
            return redirect()->to('/login')->with('error', 'Email sudah terdaftar!');
        }

        $data = [
            'fullname' => $this->request->getPost('fullname'),
            'username' => $username,
            'email'    => $email,
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'phone'    => $this->request->getPost('phone'),
        ];

        $userModel->insert($data);
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
INSERT INTO `users` (`fullname`, `username`, `email`, `password`, `phone`, `created_at`, `updated_at`) VALUES ('admin', 'admin', 'admin@gmail.com', '$2y$10$2Z/1T4yTtO2hYa0hZaAQkuNob/bOZXRO.1sA9Oq3iuMt5dKEhA1nK', '08111111111', '2025-05-23 19:28:43', '2025-05-23 19:28:43')

    public function login()
    {
        $userModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1