app/Controllers/Booking.php

    public function getNotifications()
    {
        if (!session()->get('logged_in')) {
            return $this->response->setJSON([
                'success' => false,
                'notifications' => [],
                'count' => 0
            ]);
        }

        $userId = session()->get('user_id');

        try {
            // Get recent bookings
            $bookings = $this->bookingModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `bookings`
WHERE `user_id` = '10'
ORDER BY `created_at` DESC
 LIMIT 5