app/Controllers/Home.php

    public function index()
    {
        $roomModel = new RoomModel();
        $data = [
            'rooms' => $roomModel->findAll()
        ];
---
SELECT *
FROM `rooms`