app/Controllers/RoomController.php

    public function getAvailable()
    {
        try {
            $roomType = $this->request->getVar('room_type');

            if (empty($roomType)) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Room type is required'
                ]);
            }

            // Get ALL rooms by type (both available and occupied)
            $allRooms = $this->roomModel->where('room_type', $roomType)
                                      ->orderBy('room_number', 'ASC')
                                      ->findAll();
---
SELECT *
FROM `rooms`
WHERE `room_type` = 'Kamar Standard'
ORDER BY `room_number` ASC